AlertRuleTemplateName : 7ee72a9e-2e54-459c-bc8a-8c08a6532a63
DisplayName           : Test Known IRIDIUM IP
Description           : IRIDIUM command and control IP. Identifies a match across various data feeds for IP IOCs related to the IRIDIUM activity group.
Enabled               : False
LastModifiedUtc       : 10/27/2020 2:52:32 PM
Query                 : let timeframe = 1d;
                        let IPList = dynamic(["154.223.45.38","185.141.207.140","185.234.73.19","216.245.210.106","51.91.48.210","46.255.230.229"]);
                        (union isfuzzy=true
                        (CommonSecurityLog
                        | where TimeGenerated >= ago(timeframe) 
                        | where isnotempty(SourceIP) or isnotempty(DestinationIP)
                        | where SourceIP in (IPList) or DestinationIP in (IPList) or Message has_any (IPList)
                        | extend IPMatch = case(SourceIP in (IPList), "SourceIP", DestinationIP in (IPList), 
                        "DestinationIP", "Message") 
                        | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by SourceIP, 
                        DestinationIP, DeviceProduct, DeviceAction, Message, Protocol, SourcePort, DestinationPort, 
                        DeviceAddress, DeviceName, IPMatch
                        | extend timestamp = StartTimeUtc, IPCustomEntity = case(IPMatch == "SourceIP", SourceIP, 
                        IPMatch == "DestinationIP", DestinationIP, "IP in Message Field") 
                        ),
                        (OfficeActivity
                        | where TimeGenerated >= ago(timeframe) 
                        |extend SourceIPAddress = ClientIP, Account = UserId
                        | where  SourceIPAddress in (IPList)
                        | extend timestamp = TimeGenerated , IPCustomEntity = SourceIPAddress , AccountCustomEntity = 
                        Account
                        ),
                        (DnsEvents 
                        | where TimeGenerated >= ago(timeframe) 
                        | extend DestinationIPAddress = IPAddresses,  Host = Computer
                        | where  DestinationIPAddress has_any (IPList) 
                        | extend timestamp = TimeGenerated, IPCustomEntity = DestinationIPAddress, HostCustomEntity = 
                        Host
                        ),
                        (VMConnection 
                        | where TimeGenerated >= ago(timeframe) 
                        | where isnotempty(SourceIp) or isnotempty(DestinationIp) 
                        | where SourceIp in (IPList) or DestinationIp in (IPList) 
                        | extend IPMatch = case( SourceIp in (IPList), "SourceIP", DestinationIp in (IPList), 
                        "DestinationIP", "None") 
                        | extend timestamp = TimeGenerated , IPCustomEntity = case(IPMatch == "SourceIP", SourceIp, 
                        IPMatch == "DestinationIP", DestinationIp, "None"), Host = Computer
                        ),
                        (Event
                        | where TimeGenerated >= ago(timeframe)
                        | where Source == "Microsoft-Windows-Sysmon"
                        | where EventID == 3
                        | extend EvData = parse_xml(EventData)
                        | extend EventDetail = EvData.DataItem.EventData.Data
                        | extend SourceIP = EventDetail.[9].["#text"], DestinationIP = EventDetail.[14].["#text"]
                        | where SourceIP in (IPList) or DestinationIP in (IPList) 
                        | extend IPMatch = case( SourceIP in (IPList), "SourceIP", DestinationIP in (IPList), 
                        "DestinationIP", "None") 
                        | extend timestamp = TimeGenerated, AccountCustomEntity = UserName, HostCustomEntity = 
                        Computer , IPCustomEntity = case(IPMatch == "SourceIP", SourceIP, IPMatch == "DestinationIP", 
                        DestinationIP, "None")
                        ), 
                        (WireData 
                        | where TimeGenerated >= ago(timeframe)
                        | where isnotempty(RemoteIP)
                        | where RemoteIP in (IPList)
                        | extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP, HostCustomEntity = Computer
                        ),
                        (SigninLogs
                        | where TimeGenerated >= ago(timeframe)
                        | where isnotempty(IPAddress)
                        | where IPAddress in (IPList)
                        | extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = 
                        IPAddress
                        ),
                        (W3CIISLog 
                        | where TimeGenerated >= ago(timeframe)
                        | where isnotempty(cIP)
                        | where cIP in (IPList)
                        | extend timestamp = TimeGenerated, IPCustomEntity = cIP, HostCustomEntity = Computer, 
                        AccountCustomEntity = csUserName
                        ),
                        (AzureActivity 
                        | where TimeGenerated >= ago(timeframe)
                        | where isnotempty(CallerIpAddress)
                        | where CallerIpAddress in (IPList)
                        | extend timestamp = TimeGenerated, IPCustomEntity = CallerIpAddress, AccountCustomEntity = 
                        Caller
                        ),
                        (
                        AWSCloudTrail
                        | where TimeGenerated >= ago(timeframe)
                        | where isnotempty(SourceIpAddress)
                        | where SourceIpAddress in (IPList)
                        | extend timestamp = TimeGenerated, IPCustomEntity = SourceIpAddress, AccountCustomEntity = 
                        UserIdentityUserName
                        )
                        )
QueryFrequency        : 01:00:00
QueryPeriod           : 01:00:00
Severity              : High
SuppressionDuration   : 01:00:00
SuppressionEnabled    : False
TriggerOperator       : GreaterThan
TriggerThreshold      : 0
Tactics               : {CommandAndControl}
Id                    : /subscriptions/c62cf585-7528-44dc-9ca7-8adcca36e875/resourceGroups/as-demo-rg/providers/Microso
                        ft.OperationalInsights/workspaces/ldcasdemo/providers/Microsoft.SecurityInsights/alertRules/349
                        2a26a-c336-4b73-923c-5e103fe5c28d
Name                  : 3492a26a-c336-4b73-923c-5e103fe5c28d
Type                  : Microsoft.SecurityInsights/alertRules
Etag                  : "290058ba-0000-0c00-0000-5f9834300000"
Kind                  : Scheduled